{
  "softwares": [
    {
      "id": 1,
      "nome": "Visual Studio Code",
      "titulo": "Tutorial de Instalação do VSCode",
      "descricao": [
        "O Visual Studio Code (VSCode) é um editor de código criado pela Microsoft.",
        "Ele é leve, rápido e poderoso, ideal para iniciantes e desenvolvedores experientes.",
        "Com suporte a diversas linguagens e uma vasta biblioteca de extensões, o VSCode facilita a edição de código e o desenvolvimento de projetos.",
        "Além disso, funciona no Windows, macOS e Linux, garantindo que qualquer usuário possa utilizá-lo independentemente do sistema operacional."
      ],
      "passos": [
        {
          "titulo": "1. Acesse o Site Oficial",
          "texto": [
            "Para baixar o VSCode, visite o site oficial da Microsoft.",
            "Escolha a versão adequada para seu sistema operacional."
          ]
        },
        {
          "titulo": "2. Escolha seu Sistema Operacional",
          "texto": [
            "No site, existem opções para baixar o VSCode para Windows, macOS e Linux.",
            "Selecione a opção correta e clique no botão de download."
          ]
        }
      ],
      "site": "https://code.visualstudio.com/"
    },
    {
      "id": 2,
      "nome": "Photoshop",
      "titulo": "Tutorial de Instalação do Photoshop",
      "descricao": [
        "O Adobe Photoshop é um dos softwares de edição de imagens mais usados no mundo.",
        "Ele permite criar, editar e melhorar fotos, além de ser uma ferramenta essencial para designers e fotógrafos.",
        "Disponível para Windows e macOS, o Photoshop faz parte do pacote Adobe Creative Cloud."
      ],
      "passos": [
        {
          "titulo": "1. Acesse o Site Oficial",
          "texto": [
            "Para obter o Photoshop, visite o site oficial da Adobe.",
            "Você pode optar por um plano mensal ou anual para adquirir o software."
          ]
        },
        {
          "titulo": "2. Instale o Adobe Creative Cloud",
          "texto": [
            "Antes de instalar o Photoshop, você precisa baixar o Adobe Creative Cloud.",
            "Ele gerencia todos os softwares da Adobe e facilita futuras atualizações."
          ]
        }
      ],
      "site": "https://www.adobe.com/br/products/photoshop.html"
    },
    {
      "id": 3,
      "nome": "Excel",
      "titulo": "Tutorial de Instalação do Excel",
      "descricao": [
        "O Microsoft Excel é um dos programas de planilhas mais utilizados no mundo.",
        "Ele permite criar tabelas, gráficos e análises de dados de forma intuitiva.",
        "Faz parte do pacote Microsoft 365 e está disponível para Windows e macOS."
      ],
      "passos": [
        {
          "titulo": "1. Acesse o Site Oficial da Microsoft",
          "texto": [
            "Para baixar o Excel, visite o site oficial da Microsoft.",
            "Caso necessário, adquira uma licença do Microsoft 365."
          ]
        },
        {
          "titulo": "2. Baixe e Instale o Pacote Office",
          "texto": [
            "O Excel faz parte do pacote Office 365.",
            "Ao instalar o Microsoft 365, você terá acesso ao Excel e outros aplicativos como Word e PowerPoint."
          ]
        }
      ],
      "site": "https://www.microsoft.com/pt-br/microsoft-365/excel"
    }
  ]
}
